InformationRegisters/ПривязкиОборудованияКРабочимМестам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПривязкиОборудованияКРабочимМестам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкиОборудованияКРабочимМестам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Терминал) Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Период);
		Запрос.УстановитьПараметр("РабочееМесто", ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("Терминал", ТекущийОбъект.Терминал);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПривязкиОборудованияКРабочимМестамСрезПоследних.РабочееМесто,
		               |	ПривязкиОборудованияКРабочимМестамСрезПоследних.Период
		               |ИЗ
		               |	РегистрСведений.ПривязкиОборудованияКРабочимМестам.СрезПоследних(&Дата, РабочееМесто <> &РабочееМесто) КАК ПривязкиОборудованияКРабочимМестамСрезПоследних
		               |ГДЕ
		               |	ПривязкиОборудованияКРабочимМестамСрезПоследних.Терминал = &Терминал";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Терминал " + ТекущийОбъект.Терминал + " уже привязан на рабочее место " + Выборка.РабочееМесто + " с " + Выборка.Период);
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Касса) Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Период);
		Запрос.УстановитьПараметр("РабочееМесто", ТекущийОбъект.РабочееМесто);
		Запрос.УстановитьПараметр("Касса", ТекущийОбъект.Касса);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПривязкиОборудованияКРабочимМестамСрезПоследних.РабочееМесто,
		               |	ПривязкиОборудованияКРабочимМестамСрезПоследних.Период
		               |ИЗ
		               |	РегистрСведений.ПривязкиОборудованияКРабочимМестам.СрезПоследних(&Дата, РабочееМесто <> &РабочееМесто) КАК ПривязкиОборудованияКРабочимМестамСрезПоследних
		               |ГДЕ
		               |	ПривязкиОборудованияКРабочимМестамСрезПоследних.Касса = &Касса";
					   
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Касса " + ТекущийОбъект.Касса + " уже привязана на рабочее место " + Выборка.РабочееМесто + " с " + Выборка.Период);
		КонецЕсли;	
	КонецЕсли;
	
	//+++АК sils 19.10.2018 ИП-00019421.01
	Если ЗначениеЗаполнено(ТекущийОбъект.РабочееМесто) Тогда
		ТекСтруктурнаяЕдиница = ТекущийОбъект.РабочееМесто.СтруктурнаяЕдиница;
		Если ЗначениеЗаполнено(ТекСтруктурнаяЕдиница) и ТекСтруктурнаяЕдиница.ДатаЗакрытия <> '00010101' и 
			ТекСтруктурнаяЕдиница.ДатаЗакрытия <= ТекущийОбъект.Период Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Структурная единица рабочего места " + СокрЛП(ТекущийОбъект.РабочееМесто) + 
				" (" + СокрЛП(ТекСтруктурнаяЕдиница) + ") закрыта " + Формат(ТекСтруктурнаяЕдиница.ДатаЗакрытия, "ДФ=dd.MM.yyyy") + ".");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	//---АК
КонецПроцедуры
